export const MEETINGDETIAL = {
  emotionAvg: 4, // 감정 평균 예시값
  data: [
    {
      meetingId: 1,
      userId: "user123",
      emotion: 5,
      summation:
        " 1회차 모임은 하영님이 경청을 한 날이었어요. 많은 사람들이 따뜻해졌대요. 트라우마에 대한 이야기를 털어놓고, 감정을 마주보는 시간을 가졌습니다. 수연님의 질문은 “그 날을 떠올렸을때 가장 먼저 드는 감정은 무엇인가요?”였습니다. 수연님은 “아쉬움”이라고 대답했어요. 어머니를 더 이해하고 싶어해요.",
      cheeringMessage: "혼자서 모든 것을 해결하지 않고 사람들과 함께 어려움을 나누는 것도 중요해요. 함께 힘내요 💪",
      speechAmount: 20,
      date: "2024-02-09 18:30:00",
      period: 7,
      progressWeeks: 1,
    },
    {
      meetingId: 2,
      userId: "user123",
      emotion: 4,
      summation:
        " 1회차 모임은 하영님이 경청을 한 날이었어요. 많은 사람들이 따뜻해졌대요. 트라우마에 대한 이야기를 털어놓고, 감정을 마주보는 시간을 가졌습니다. 수연님의 질문은 “그 날을 떠올렸을때 가장 먼저 드는 감정은 무엇인가요?”였습니다. 수연님은 “아쉬움”이라고 대답했어요. 어머니를 더 이해하고 싶어해요.",
      cheeringMessage: "혼자서 모든 것을 해결하지 않고 사람들과 함께 어려움을 나누는 것도 중요해요. 함께 힘내요 💪",
      speechAmount: 20,
      date: "2024-02-09 18:30:00",
      period: 7,
      progressWeeks: 2,
    },
    {
      meetingId: 3,
      userId: "user123",
      emotion: 1,
      summation:
        " 1회차 모임은 하영님이 경청을 한 날이었어요. 많은 사람들이 따뜻해졌대요. 트라우마에 대한 이야기를 털어놓고, 감정을 마주보는 시간을 가졌습니다. 수연님의 질문은 “그 날을 떠올렸을때 가장 먼저 드는 감정은 무엇인가요?”였습니다. 수연님은 “아쉬움”이라고 대답했어요. 어머니를 더 이해하고 싶어해요.",
      cheeringMessage: "혼자서 모든 것을 해결하지 않고 사람들과 함께 어려움을 나누는 것도 중요해요. 함께 힘내요 💪",
      speechAmount: 20,
      date: "2024-02-09 18:30:00",
      period: 7,
      progressWeeks: 3,
    },
    {
      meetingId: 4,
      userId: "user123",
      emotion: 3,
      summation:
        " 1회차 모임은 하영님이 경청을 한 날이었어요. 많은 사람들이 따뜻해졌대요. 트라우마에 대한 이야기를 털어놓고, 감정을 마주보는 시간을 가졌습니다. 수연님의 질문은 “그 날을 떠올렸을때 가장 먼저 드는 감정은 무엇인가요?”였습니다. 수연님은 “아쉬움”이라고 대답했어요. 어머니를 더 이해하고 싶어해요.",
      cheeringMessage: "혼자서 모든 것을 해결하지 않고 사람들과 함께 어려움을 나누는 것도 중요해요. 함께 힘내요 💪",
      speechAmount: 20,
      date: "2024-02-09 18:30:00",
      period: 7,
      progressWeeks: 4,
    },
    {
      meetingId: 5,
      userId: "user123",
      emotion: 7,
      summation:
        " 1회차 모임은 하영님이 경청을 한 날이었어요. 많은 사람들이 따뜻해졌대요. 트라우마에 대한 이야기를 털어놓고, 감정을 마주보는 시간을 가졌습니다. 수연님의 질문은 “그 날을 떠올렸을때 가장 먼저 드는 감정은 무엇인가요?”였습니다. 수연님은 “아쉬움”이라고 대답했어요. 어머니를 더 이해하고 싶어해요.",
      cheeringMessage: "혼자서 모든 것을 해결하지 않고 사람들과 함께 어려움을 나누는 것도 중요해요. 함께 힘내요 💪",
      speechAmount: 20,
      date: "2024-02-09 18:30:00",
      period: 7,
      progressWeeks: 5,
    },
    {
      meetingId: 6,
      userId: "user123",
      emotion: 8,
      summation:
        " 1회차 모임은 하영님이 경청을 한 날이었어요. 많은 사람들이 따뜻해졌대요. 트라우마에 대한 이야기를 털어놓고, 감정을 마주보는 시간을 가졌습니다. 수연님의 질문은 “그 날을 떠올렸을때 가장 먼저 드는 감정은 무엇인가요?”였습니다. 수연님은 “아쉬움”이라고 대답했어요. 어머니를 더 이해하고 싶어해요.",
      cheeringMessage: "혼자서 모든 것을 해결하지 않고 사람들과 함께 어려움을 나누는 것도 중요해요. 함께 힘내요 💪",
      speechAmount: 20,
      date: "2024-02-09 18:30:00",
      period: 7,
      progressWeeks: 6,
    },
    // {
    //   meetingId: 7,
    //   userId: "user123",
    //   emotion: 5,
    //   summation:
    //     " 1회차 모임은 하영님이 경청을 한 날이었어요. 많은 사람들이 따뜻해졌대요. 트라우마에 대한 이야기를 털어놓고, 감정을 마주보는 시간을 가졌습니다. 수연님의 질문은 “그 날을 떠올렸을때 가장 먼저 드는 감정은 무엇인가요?”였습니다. 수연님은 “아쉬움”이라고 대답했어요. 어머니를 더 이해하고 싶어해요.",
    //   cheeringMessage: "혼자서 모든 것을 해결하지 않고 사람들과 함께 어려움을 나누는 것도 중요해요. 함께 힘내요 💪",
    //   speechAmount: 20,
    //   date: "2024-02-09 18:30:00",
    //   period: 7,
    //   progressWeeks: 7,
    // },
  ],
};
